{
  "title": "Bara's Portfolio",
  "page": {
    "home": {
      "heading": {
        "title1": "Hello! ",
        "title2": "I am  ",
        "title3": "Bára Kalinová ",
        "desc": "I am a student of primary english billingual school in 9th grade. I am applying to Smíchovská Střední průmyslová Škola. I created this portfolio to present myself, what I already achieved or I like.",
        "desc2": "I have been interested in web development for a while now, so I created the portfolio in React to practice more. The portfolio is divided into four parts. Each contains a different topic I engage in. This page summarises all of them and you can dive into each part to see more."
      },
      "sport": {
        "title": "Sport",
        "desc": "I do sport because it helps me build my physic and it helps me mentally. It boost my mood and it challenges me to try new things and get sensational in them."
      },
      "hobbies": {
        "title": "Hobbies",
        "desc": "Hobbies are a way of relaxation and enjoyment for me. It helps me with my creativity and it puts away the stress I have, at least for a while. It also makes new friends that have the same interest as you."
      },
      "technology": {
        "title": "Technology",
        "desc": "I programm to solve problems, express creativity, and build useful tools. It offers great career opportunities and continuous learning as technology evolves. It empowers me to turn my ideas into reality."
      },
      "education": {
        "title": "Education",
        "desc": "I believe education is a cornerstone of personal growth and social progress. I would like to expand my knowledge and skills in informational technology. I am passionate about exploring new ideas, trying out different challenges and applying what I learn to real life."
      }
    },
    "sport": {
      "title": "Sport",
      "heading": {
        "title": "Sport",
        "desc": "I enjoy a variety of activities, including climbing and aerial hoop. From my young age I participated in various sport competitions like running, climbing and cross-country skiing. My parents always led me to sports and we did them together. "
      },
      "climbing": {
        "title": "Climbing",
        "desc": "I climb in <ddmLink>DDM Modřany</ddmLink>. I have been climbing since I was 12 years old and I even persuaded my dad to climb with me. I enjoy climbing very much and I am even a little bit stronger which is a positive thing about it. "
      },
      "aerial": {
        "title": "Aerial Hoop",
        "desc": "I do Arial Hoop at home. I have been doing Arial Hoop since I was 13 years old. At first I did it with my friend from school at an afternoon club but now I have an aerial hoop at home and I train at home. I do this sport just for fun and it's mostly just about doing some new skills on the hoop. "
      }
    },
    "technology": {
      "title": "Technology",
      "heading": {
        "title": "Technology",
        "desc": "I have explored technology through courses like Make IT Today and Intro to IT, learning coding, web development, 3D printing, and robotics. I attended Media Creation for photography, video production, and podcasts. My programming journey began with Scratch at age 8, followed by JavaScript for Kids and Harvard's CS50 course, where I created games, animations, and web pages. I also built my portfolio using Next.js, TypeScript, and Tailwind, gaining experience in React and GitHub."
      },
      "portfolio": {
        "title": "Portfolio",
        "desc": "I made this portfolio with my dad's help. The code is written in <nextJsLink>Next.js</nextJsLink> and the programming language is <typeScriptLink>TypeScript</typeScriptLink>. Because of Next.js I learned basics of <reactLink>React</reactLink>. It is styled with <nextUiLink>HeroUI</nextUiLink> and <tailwindLink>Tailwind</tailwindLink>. And it is versioned in <githubLink>GitHub</githubLink>."
      },
      "introIt": {
        "title1": "Intro into ",
        "title2": "Programming",
        "title3": "and",
        "title4": "IT world",
        "desc": "I have attended this programming <courseLink>course</courseLink> from <sspsLink>SSPŠ</sspsLink>. We learned there basics of phyton. The teachers were very nice and they made it fun. "
      },
      "cs50": {
        "title": "CS50",
        "desc": "I found this online <courseLink1>course</courseLink1> for computer science from Harvard. I watched the videos without going through the exams. It is free and it is build very understandably. The teacher is very good at teaching and he knows a lot of things about programming and makes it fun."
      },
      "girlsGroup": {
        "title1": "Intro to ",
        "title2": "IT ",
        "title3": "from ",
        "title4": "Girls group ",
        "desc": "It is a day camp about informational technologies at the Smíchovská Secondary Technical School that I took. We learned IT basics, web development, and 3D printing. We engaged with virtual technology and Lego robotics. We also took and edited some photograps we made. Here is the <certificateLink>certificate</certificateLink>."
      },
      "media": {
        "title1": "Media",
        "title2": "creation",
        "desc": "I went on a summer school at the Smíchovská Secondary Technical School. We did things like digital photography, video production, podcast creation and a lot of editing. We also recorded a <podcastLink>podcast</podcastLink> about that school."
      },
      "web": {
        "title1": "Intro to",
        "title2": "Programming",
        "title3": "of a web page",
        "desc": "It is a day camp from <makeItLink>Make IT Today</makeItLink> for basic coding that I took. It is designed to enhance programming skills through fun and interactive pojects. We had exciting activities such as working with robots, virtual reality and 3D modeling. We made codes for simple games and web pages, and we solved a lot of challenges. I created a <webLink>web page</webLink> about yarns. Here is the <certificateLink1>certificate</certificateLink1>."
      },
      "javascript": {
        "title1": "Javascript",
        "title2": "for",
        "title3": "Kids",
        "desc": "I took this online Javascript <courseLink2>course</courseLink2> from <udemyLink>Udemy</udemyLink> . It is designed to teach you Javascript in a fun and simple way. I learned there different fundimetals of Javascript. I created a lot of fun projects like interactive games and animations. I learned how to solve some simple problems and understand the core prinicipal of programming. I created couple of games and utilities, for example <calculatorLink>Investment</calculatorLink> Calculator or <dragDrawLink>Drag and Draw</dragDrawLink>."
      },
      "scratch": {
        "title": "Scratch",
        "desc": "I started with <scratchLink>Scratch</scratchLink> when I was 8 years old. My dad helped me with it. I loved it back in the time and it was very fun to play with. I also made a couple of simple games, for example <dragonChaseLink>Dragon Chase</dragonChaseLink> or <sayHelloLink>Say Hello</sayHelloLink>."
      }
    },
    "hobbies": {
      "title": "Hobbies",
      "heading": {
        "title": "Hobbies",
        "desc": "I enjoy crocheting, painting, and being part of my band. Crocheting brings me peace and helps me focus, while painting lets me express creativity, even with simple lines. In my band at DDM in Modřany, I write lyrics for our songs, and we perform at events and for our families. "
      },
      "crocheting": {
        "title": "Crocheting",
        "desc": "I have been crocheting a long time now, something about 5 years and I think I am pretty good at it. I enjoy it because it brings me peace and I can just sit down and do one thing and not worry about other stuff. That is what I love about crocheting. "
      },
      "painting": {
        "title": "Painting",
        "desc": "I have been painting my whole life, but probably like 3 years ago it started looking good. I like it because you can paint anything you want and even when you don't known how to paint you can paint something because you can just paint some lines on the paper and make it look good."
      },
      "band": {
        "title": "My Band",
        "desc": "My band is a afternoon course in <ddmLink>DDM in Modřany</ddmLink>. It all started when I once went to a band course and we just played some songs. Now we even write our own <songLink>songs</songLink> and I am usually the one that is writing the lyrics and than someone else from the band writes the music for it. We have some concerts for our parents but we also play at some actions that are in DDM in modřany."
      }
    },
    "education": {
      "title": "Education",
      "heading": {
        "title": "Education",
        "desc": "I study at ZŠ Angel and I have done 2 Cambridge exams. I have competed in several sport competitions organised by my primary school. I have been learning English from a very early age."
      },
      "B2": {
        "title1": "B2",
        "title2": "Cambridge",
        "title3": "Exam",
        "desc": "I have done my second Cambridge exam in 9th grade and it was level B2. Here is the <resultLink>certificate</resultLink>."
      },
      "A2": {
        "title1": "A2",
        "title2": "Cambridge",
        "title3": "Exam",
        "desc": "I have done my first Cambridge exam in 5th grade and it was level A2. Here is the <certificateLink1>certificate</certificateLink1>."
      },
      "school": {
        "title1": "Primary",
        "title2": "school",
        "desc": "I study at <zsangelLink>ZŠ Angel</zsangelLink>, a bilingual school where I’ve developed strong English skills and a good accent thanks to native speakers from various English-speaking countries. I have participated in various activities in our school. From 8th grade I am a member of <cheerTeamLink>Angel Cheer Team</cheerTeamLink>. I got a <praiseLink>praise</praiseLink> for dancing at the school Christmas play by my class teacher. In 6th grade I was presenting our school in the Prague 12 town hall."
      }
    }
  }
}
