{
  "title": "Báry portfolio",
  "page": {
    "home": {
      "heading": {
        "title1": "Zdravím! ",
        "title2": "Já jsem  ",
        "title3": "Bára Kalinová",
        "desc": "Jsem student 9. třídy na anglické bilingvní základní škole a hlásím se na Smíchovskou střední průmyslovou školu.Toto portfolio jsem vytvořila, abych představila své úspěchy, zájmy a dovednosti. Odráží, kdo jsem a co mě baví. Jedním z mých hlavních zájmů je webový vývoj, kterému se již delší dobu věnuji. Abych se posunula dál, vytvořila jsem toto portfolio v Reactu. Je rozděleno do čtyř částí, přičemž každá se zaměřuje na jiné téma, které mě zajímá. Tato stránka nabízí přehled všech částí a umožňuje vám nahlédnout do každé z nich podrobněji."
      },
      "sport": {
        "title": "Sport",
        "desc": "Sportuji, protože sport mi pomáhá budovat fyzickou kondici a také mě podporuje psychicky. Zlepšuje mi náladu, vyzývá mě k vyzkoušení nových věcí a motivuje mě zdokonalit se v nich."
      },
      "hobbies": {
        "title": "Koníčky",
        "desc": "Koníčky jsou pro mě způsobem relaxace a zábavy. Pomáhají mi rozvíjet kreativitu a alespoň na chvíli mě zbaví stresu. Také mi umožňují najít nové přátele, kteří mají stejné zájmy jako já."
      },
      "technology": {
        "title": "Technologie",
        "desc": "Programování mi umožňuje řešit problémy, vyjadřovat svou kreativitu a vytvářet nástroje, které mají smysl. Nabízí skvělé kariérní příležitosti a neustálé učení, protože technologie se neustále vyvíjí. Nejvíce mě však baví, že mi dává možnost proměnit mé nápady ve skutečnost."
      },
      "education": {
        "title": "Vzdělání",
        "desc": "Věřím, že vzdělání je základním kamenem osobního rozvoje a společenského pokroku. Rád bych si rozšířila své znalosti a dovednosti v oblasti informačních technologií. Jsem nadšená z objevování nových nápadů, zkoušení různých výzev a aplikování toho, co se naučím, do reálného života."
      }
    },
    "sport": {
      "title": "Sport",
      "heading": {
        "title": "Sport",
        "desc": "Baví mě různé aktivity, včetně lezení a arialhoopu. Už od dětství jsem se účastnila různých sportovních soutěží, jako je běh, lezení a běh na lyžích. Moji rodiče mě vždy vedli ke sportu a sportovali jsme spolu."
      },
      "climbing": {
        "title": "Lezení",
        "desc": "Lezu v <ddmLink>DDM Modřany</ddmLink>. Lezu od svých 12 let a dokonce jsem přemluvil tátu, aby lezl se mnou. Lezení mě velmi baví a jsem i o něco silnější, což je určitě pozitivní stránka tohoto sportu."
      },
      "aerial": {
        "title": "Aerial Hoop",
        "desc": "Dělám Aerial Hoop doma. Cvičím Aerial Hoop od 13 let. Na začátku jsem to dělala s kamarádkou ze školy na kroužku, ale teď mám akrobatický kruh doma a trénuji doma. Tento sport dělám hlavně pro zábavu a jde mi především o to, naučit se nové dovednosti na kruhu."
      }
    },
    "technology": {
      "title": "Technologie",
      "heading": {
        "title": "Technologie",
        "desc": "Technologii jsem prozkoumávala prostřednictvím kurzů, jako je Make IT Today a Intro do IT, kde jsem se učila programování, webový vývoj, 3D tisk a robotiku. Navštěvovala jsem kurz Mediální tvorba zaměřený na fotografii, produkci videí a podcasty. Moje cesta v programování začala ve 8 letech se Scratchem, následoval JavaScript for Kids a kurz CS50 od Harvardské univerzity, kde jsem vytvářela hry, animace a webové stránky. Také jsem vytvořila své portfolio pomocí Next.js, TypeScriptu a Tailwind, čímž jsem získala zkušenosti s Reactem a GitHubem."
      },
      "portfolio": {
        "title": "Portfolio",
        "desc": "Toto portfolio jsem vytvořila s pomocí svého táty. Kód je napsaný v <nextJsLink>Next.js</nextJsLink> a programovacím jazyce <typeScriptLink>TypeScript</typeScriptLink>. Díky Next.js jsem se naučila základy <reactLink>React</reactLink>. Stylování je vytvořeno pomocí <nextUiLink>HeroUI</nextUiLink> a <tailwindLink>Tailwind</tailwindLink>. A je verzováno na <githubLink>GitHub</githubLink>."
      },
      "introIt": {
        "title1": "Úvod do ",
        "title2": "Programování",
        "title3": "a",
        "title4": "IT světa",
        "desc": "Navštěvovala jsem tento programátorský <courseLink>kurz</courseLink> od <sspsLink>SSPŠ</sspsLink>. Naučili jsme se tam základy Pythonu. Učitelé byli fajn a výuka byla zábavná."
      },
      "cs50": {
        "title": "CS50",
        "desc": "Tento online <courseLink1>kurz</courseLink1> informatiky od Harvardu jsem objevila na internetu. Sledovala jsem videa, aniž bych procházela testy. Je zdarma a velmi srozumitelně zpracovaný. Učitel skvěle vysvětluje, má rozsáhlé znalosti o programování a umí dělat výuku zábavnou."
      },
      "girlsGroup": {
        "title1": "Úvod do ",
        "title2": "IT ",
        "title3": "od ",
        "title4": "Dívčího Spolku ",
        "desc": "Zúčastnila jsem se příměstského táboru o informačních technologiích na Smíchovské střední průmyslové škole. Naučili jsme se základy IT, webový vývoj a 3D tisk. Pracovali jsme s virtuální realitou a Lego robotikou. Také jsme pořizovali a upravovali fotografie, které jsme vyfotili.Zde je můj <certificateLink>certfikát</certificateLink>."
      },
      "media": {
        "title1": "Mediální",
        "title2": "tvorba",
        "desc": "Navštěvovala jsem letní školu na Smíchovské střední průmyslové škole. Věnovali jsme se digitální fotografii, tvorbě videí, nahrávání podcastů a spoustě úprav. Také jsme natočili <podcastLink>podcast</podcastLink> o této škole."
      },
      "web": {
        "title1": "Úvod do",
        "title2": "Programování",
        "title3": "webu",
        "desc": "Zúčastnila jsem se denního kempu od <makeItLink>Make IT Today</makeItLink> zaměřeného na základy programování. Byl navržen tak, aby zlepšil programátorské dovednosti pomocí zábavných a interaktivních projektů. Měli jsme spoustu zajímavých aktivit, jako práci s roboty, virtuální realitou a 3D modelováním. Psali jsme kódy pro jednoduché hry a webové stránky a řešili mnoho výzev. Také jsem vytvořila <webLink>webovou stránku</webLink> o přízích. Zde je můj <certificateLink1>certificate</certificateLink1>."
      },
      "javascript": {
        "title1": "Javascript",
        "title2": "pro",
        "title3": "děti",
        "desc": "Absolvovala jsem online <courseLink2>kurz</courseLink2> JavaScriptu na <udemyLink>Udemy</udemyLink>. Je navržen tak, aby učil JavaScript zábavnou a jednoduchou formou. Naučila jsem se zde různé základy JavaScriptu a vytvořila spoustu zábavných projektů, jako jsou interaktivní hry a animace. Získala jsem také schopnost řešit jednoduché problémy a pochopila klíčové principy programování. Vytvořila jsem několik her a užitečných nástrojů, například <calculatorLink>Investiční kalkulačka</calculatorLink> nebo <dragDrawLink>Drag and Draw</dragDrawLink>."
      },
      "scratch": {
        "title": "Scratch",
        "desc": "Se <scratchLink>Scratchem</scratchLink> jsem začala, když mi bylo 8 let. Můj táta mi s ním pomáhal. Tehdy jsem ho naprosto milovala a moc mě bavilo si s ním hrát. Také jsem vytvořila několik jednoduchých her, například <dragonChaseLink>Dragon Chase</dragonChaseLink> nebo <sayHelloLink>Say Hello</sayHelloLink>."
      }
    },
    "hobbies": {
      "title": "Koníčky",
      "heading": {
        "title": "Koníčky",
        "desc": "Baví mě háčkování, malování a být součástí své kapely. Háčkování mi přináší klid a pomáhá mi se soustředit, zatímco malování mi umožňuje vyjádřit svou kreativitu. V mé kapele píšu texty k našim písním a vystupujeme na akcích a pro naše rodiny."
      },
      "crocheting": {
        "title": "Háčkování",
        "desc": "Háčkuji už dlouho, asi 5 let, a myslím, že jsem v tom celkem dobrá. Baví mě to, protože mi to přináší klid a můžu si jen sednout, soustředit se na jednu věc a nemuset se starat o ostatní věci. To je to, co na háčkování miluji."
      },
      "painting": {
        "title": "Malování",
        "desc": "Maluji celý svůj život, ale asi před 3 lety to začalo vypadat dobře. Líbí se mi to, protože můžeš malovat, co chceš, a i když nevíš, jak malovat, můžeš vytvořit něco pěkného, protože stačí nakreslit pár čar na papír a ono to vypadá dobře."
      },
      "band": {
        "title": "My Band",
        "desc": "Moje kapela je odpolední kroužek v <ddmLink>DDM v Modřanech</ddmLink>. Všechno to začalo, když jsem jednou šla na kurz kapely a jen jsme si hráli nějaké písničky. Teď už i píšeme vlastní <songLink>písničky</songLink>. Máme koncerty pro naše rodiče, ale také hrajeme na různých akcích."
      }
    },
    "education": {
      "title": "Vzdělání",
      "heading": {
        "title": "Vzdělání",
        "desc": "Studuji na ZŠ Angel a absolvovala jsem dvě Cambridge zkoušky. Soutěžila jsem v několika sportovních soutěžích organizovaných mojí základní školou. Učím se angličtinu už od raného věku."
      },
      "B2": {
        "title1": "B2",
        "title2": "Cambridge",
        "title3": "Test",
        "desc": "Ve 9. třídě jsem absolvovala svou druhou Cambridge zkoušku na úrovni B2. Zde je <resultLink>certifikát</resultLink>."
      },
      "A2": {
        "title1": "A2",
        "title2": "Cambridge",
        "title3": "Test",
        "desc": "Svou první Cambridge zkoušku jsem absolvovala v 5. třídě na úrovni A2. Zde je můj <certificateLink1>certifikát</certificateLink1>."
      },
      "school": {
        "title1": "Primary",
        "title2": "school",
        "desc": "Studuji na <zsangelLink>ZŠ Angel</zsangelLink>, bilingvní škole, kde jsem si díky rodilým mluvčím z různých anglicky mluvících zemí rozvinula silné dovednosti v angličtině a dobrý přízvuk. Účastnila jsem se různých aktivit na naší škole. Od 8. třídy jsem členkou <cheerTeamLink>Angel Cheer Týmu</cheerTeamLink>. Za tanec na školní vánoční besídce jsem dostala <praiseLink>pochvalu</praiseLink> od třídní učitelky. V 6. třídě jsem reprezentovala naši školu na radnici Prahy 12."
      }
    }
  }
}
